


public class cipher {
    public static void main(String[] args)  throws Exception {

        String text = "Еъёчхф Вхзёюлх, адздёиу ф ждэщхб, црбх еёдюэчъщъгюъв южаижжзчх, ждчъёнъгжзчдв. Ъы зёюивй жёхчгюв бюнс ж ъы вдгивъгзхбсгрв аёхкдв. Зъеъёс вгъ дмъчющгд, мзд гъюэцъьгджзс тздшд аёхкх фчбфъзжф жбъщжзчюъв гъждчъёнъгжзчх мъбдчъмъжадшд югщючющиивх. Ф юэимюб чхни южздёюу ю чгыж юэвъгъгюф, здмгъъ дзёхэюч еджздфггиу юэвъгмючджзс мъбдчъмъжаюк едёдадч. Ю зъв гъ въгъъ, еджбъщдчхбх гъищхмх. Ф еёюнъб а чрчдщи, мзд чюгдя чжъви вдя югзъббъаз, х чдэвдьгд, вды мёъэвъёгдъ жзёъвбъгюъ ад чжъви шхёвдгюмгдви. Гхязю ёънъгюъ вгъ едвдшбх еёдшёхввх югзиюзючгдшд зюех, жеълюхбсгд ждэщхггхф щбф юэимъгюф деёъщъбъггрк жздёдг мъбдчъмъжадя щиню. Въгф вдьгд гхэчхзс дзлдв Вхзёюлр, х ъы, цъэ еёъичъбюмъгюф, вхзъёсу.";
        char[] abc = new char[] {'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'};




        // первый цикл определяет смещение (ключ)
        for (int i = 1; i < abc.length; i++) {

            char[] array = text.toCharArray();

            // второй цикл проходит по каждому элементу массива array
            for (int y = 0; y < array.length; y++) {

                // каждый y-ый элемент массива array сравнивается с каждым элементом массива abc (ищем совпадение элементов массивов array и abc)
                for (int z = 0; z < abc.length; z++) {

                    // если совпдаение найдено, то меняем элемент array[y], на abc[z + i] (i - смещение вправо)
                    if ((array[y]+"").equalsIgnoreCase(abc[z]+"")) {


                        boolean symbol =  Character.isUpperCase(array[y]); // проверяет верхний ли регистр


                        if ((z + i) > 32) {

                            array[y] = abc[(z + i) - abc.length];

                            if (symbol) {
                                array[y] = Character.toUpperCase(array[y]);
                            }

                            break;

                        } else {

                            array[y] = abc[z+i];

                            if (symbol) {
                                array[y] = Character.toUpperCase(array[y]);
                            }
                            break;

                        }
                    }

                }

            }
            System.out.print(new String(array));
            System.out.println();

        }

    }

}